# SolidOrShellTessellationControls Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SolidOrShellTessellationControls Constructor
SolidOrShellTessellationControls Class See Also
---
Default constructor.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public SolidOrShellTessellationControls()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
SolidOrShellTessellationControls()
```

# See Also
SolidOrShellTessellationControls Class
Autodesk.Revit.DB Namespace